{
    "What is the purpose of the U.S. Constitution?": "To establish a framework for government and protect citizens' rights.",
    "How many articles are in the U.S. Constitution?": "There are seven articles.",
    "What are the three branches of the U.S. government?": "Legislative, Executive, and Judicial.",
    "What does the Legislative Branch do?": "Makes laws.",
    "What does the Executive Branch do?": "Enforces laws.",
    "What does the Judicial Branch do?": "Interprets laws.",
    "How many senators does each state have?": "Each state has two senators.",
    "What is the term length of a U.S. Senator?": "Six years.",
    "What is the term length of a U.S. Representative?": "Two years.",
    "How many members are in the House of Representatives?": "435 members.",
    "Who is the Commander in Chief of the military?": "The President of the United States.",
    "What is the Bill of Rights?": "The first ten amendments to the U.S. Constitution.",
    "What freedoms does the First Amendment protect?": "Speech, religion, press, assembly, and petition.",
    "What is the Second Amendment about?": "The right to bear arms.",
    "What protection does the Fourth Amendment provide?": "Protection against unreasonable searches and seizures.",
    "What is double jeopardy under the Fifth Amendment?": "A person cannot be tried twice for the same crime.",
    "Which amendment abolished slavery?": "The Thirteenth Amendment.",
    "What is the Fourteenth Amendment about?": "It defines citizenship and guarantees equal protection under the law.",
    "Which amendment gave women the right to vote?": "The Nineteenth Amendment.",
    "How many amendments does the U.S. Constitution have?": "27 amendments.",
    "What is the Twenty-Second Amendment?": "It limits the President to two terms in office.",
    "Who elects the President of the United States?": "The Electoral College.",
    "What is the impeachment process?": "The House of Representatives impeaches, and the Senate holds the trial.",
    "What does the Twenty-Sixth Amendment do?": "It lowers the voting age to 18.",
    "What is the Commerce Clause?": "It allows Congress to regulate commerce with foreign nations and between states.",
    "What does the Tenth Amendment state?": "Powers not given to the federal government belong to the states or the people.",
    "What is the Supremacy Clause?": "It establishes that federal law takes precedence over state laws.",
    "What is the Necessary and Proper Clause?": "It allows Congress to pass laws required to carry out its powers.",
    "What is habeas corpus?": "The right to challenge unlawful detention.",
    "What is the process for amending the U.S. Constitution?": "A two-thirds vote in Congress and ratification by three-fourths of the states.",
    "What is the role of the Vice President?": "To preside over the Senate and assume the presidency if needed.",
    "Who appoints Supreme Court justices?": "The President, with Senate confirmation.",
    "How long is a Supreme Court Justice’s term?": "They serve for life unless they resign, retire, or are impeached.",
    "What is the process for declaring war?": "Only Congress has the power to declare war.",
    "What is the Full Faith and Credit Clause?": "It requires states to recognize public acts, records, and judicial proceedings from other states.",
    "Which amendment repealed Prohibition?": "The Twenty-First Amendment.",
    "What is the purpose of checks and balances?": "To prevent any one branch of government from becoming too powerful.",
    "What does the Fifth Amendment guarantee?": "Protection against self-incrimination and double jeopardy, and guarantees due process.",
    "What is the Equal Protection Clause?": "It ensures all citizens receive equal protection under the law."
}